{
    "anonymous_company": "Recruityard",
    "title": "Beauty Advisor with German",
    "reference": "CC-0324-2",
    "available_slots_id": 14,
    "category_ids": [
      9
    ],
    "country_id": 620,
    "district_ids": [
      13
    ],
    "municipality_id": 1312,
    "location": "Porto",
    "contract_type_id": 1,
    "schedule_type_id": 1,
    "min_qualifications_id": 2,
    "professional_experience_id": 1,
    "annual_salary_range_id": 3,
    "offer_description": "<p>We are recruiting on behalf of our client, a leading outsourcing company providing customer and technical support, content moderation, sales, and marketing services. We have exciting job opportunities in Porto!</p>\n<p>Take the next step in your career by working with top global brands in a dynamic, fast-paced environment alongside a supportive team.</p>\n<p>We seek individuals eager to make an impact, add value, and unleash their full potential.</p>\n<p>Are you fluent in German and passionate about beauty? Represent a luxury brand in Customer Care – this opportunity is for you!</p>\n<h3>What You Will Do:</h3>\n<ul>\n<li>- Provide advice, answer questions, and promote the client’s brands in every interaction;</li>\n<li>- Communicate with consumers by telephone, email, live chat, messaging and social media;</li>\n<li>- Provide advanced sales through servicing to ensure well rounded and complete beauty solution for consumers;</li>\n<li>- Place orders, resolve technical queries, and undertake associated administrative activities.</li>\n<li>- Provide first contact resolution on service inquiries, complaints and on complex consumer questions within a variety of topics;</li>\n<li>- Liaise with leadership and other teams to ensure a full resolution for the consumer.</li>\n<li>- Understand the potential risk to the business of some inquiries/complaints; Show awareness when cases need to be escalated to an I&E advisor or Team Leader (i.e. viral social media public posts)</li>\n</ul>\n<h3>What You Need:</h3>\n<ul>\n<li>- Fluent level of written and verbal communication skills in German.</li>\n<li>- Good level of written and verbal communication skills in English (minimum B2).</li>\n<li>- Excellent communication skills and social intelligence – empathy, self-awareness, cultural sensitivity.</li>\n<li>- Aptitude for problem-solving;</li>\n<li>- Dynamism and team spirit;</li>\n<li>- Flexible and quick learner, able to adapt continuously.</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>- Comprehensive relocation support to Porto for candidates relocating from abroad;</li>\n<li>- Competitive monthly salary;</li>\n<li>- Health benefits and various other discounts;</li>\n<li>- Full training provided by certified instructors;</li>\n<li>- Opportunities for career advancement and professional development;</li>\n</ul>\n<p>You are giving your GDPR consent for your CV details to be shared directly with our client for the purpose of recruitment</p>",
    "emails_to_notify": [
      "info@recruityard.com"
    ],
    "start_date": "2020-07-15",
    "end_date": "2020-08-14",
    "work_model": "remote",
    "cv_required": 1
  }